openCybertruck/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    tarmac
    {
        type            fixedValue;
        value           uniform (-30 0 0);
    }
    upperArea
    {
        type            fixedValue;
        value           uniform (-30 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (-30 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    lateralArea
    {
        type            fixedValue;
        value           uniform (-30 0 0);
    }
    symmetryPlane
    {
        type            symmetry;
    }
    bodyCassoneAperto_mm
    {
        type            noSlip;
    }
    FR_mm
    {
        type            rotatingWallVelocity;
        origin          (1.94805 -1.00115 -0.4286);
        axis            (0 1 0);
        omega           
        {
            type            constant;
            value           67.8871;
        }
        value           uniform (0 0 0);
    }
    RR_mm
    {
        type            rotatingWallVelocity;
        origin          (-1.72629 -1.00115 -0.4286);
        axis            (0 1 0);
        omega           
        {
            type            constant;
            value           67.8871;
        }
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
