openCybertruck/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.78;

boundaryField
{
    tarmac
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
    upperArea
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1.78;
    }
    outlet
    {
        type            zeroGradient;
    }
    lateralArea
    {
        type            zeroGradient;
    }
    symmetryPlane
    {
        type            symmetry;
    }
    bodyCassoneAperto_mm
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
    FR_mm
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
    RR_mm
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
}


// ************************************************************************* //
